package base;

public class BitOperation {
    public static void main(String[] args) {
        /*
         *  A = 0011 1100
         *  B = 0000 1101
         *
         *  A&B = 0000 1100 (对应位都是1时，才是1)
         *  A|B = 0011 1101 (对应位有1就是1)
         *  A^B = 0011 0001 (对应位相同就是0)
         *   ~B = 1111 0010 (对应位取反)
         *
         * 和底层相关 - 效率极高
         * << *2
         * >> /2
         *
         * 16 = 2 * 2 * 2 * 2
         *
         * 0000 0000   0
         * 0000 0001   1
         * 0000 0010   2
         * 0000 0011   3
         * 0000 0100   4
         * 0000 1000   8
         * 0001 0000   16
         */

        System.out.println(2<<3); // 16
    }
}
